# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionTypeSet..::..ForwardIterator Method
MullionTypeSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual MullionTypeSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As MullionTypeSetIterator
```

Visual C++
---
```text
public:
virtual MullionTypeSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace